app/controllers/school_classes_controller.rb

    def create

        @schoolclass = SchoolClass.new
	    @schoolclass.title = params[:school_class][:title]
	    @schoolclass.room_number = params[:school_class][:room_number]
	    @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

    def show
        @schoolclass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @schoolclass = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update

        @schoolclass = SchoolClass.find(params[:id])
        @schoolclass.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]